Autodesk.Navisworks.Api.Data.DatabaseChangeCollection
Collection of DatabaseChange that only supports Enumerable style interfaces

Autodesk.Navisworks.Api.Data.DatabaseChangeCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.Data.DatabaseChangeCollection.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Data.DatabaseChangeCollection.Where(Autodesk.Navisworks.Api.Data.DatabaseChangeTypes)
Filters the changes based on changeType
changeType: Which DatabaseChangeTypes will be cared

Autodesk.Navisworks.Api.Data.DatabaseChangeCollection.Where(System.String)
Filters the changes based on tablesName
tableNames: Which tables would be cared. support multi tables and use white space between table names, Like "ABC def".

Autodesk.Navisworks.Api.Data.DatabaseChangeCollection.Where(System.String,Autodesk.Navisworks.Api.Data.DatabaseChangeTypes)
Filters the changes based on tableNames and changeType
tableNames: Which tables would be cared. support multi tables and use white space between table names, Like "ABC def".
changeType: Which DatabaseChangeTypes will be cared